In [3]:
import pandas as pd
pd.set_option('display.max_columns', 500) 

# Set to show only how much columns

In [25]:
df_cars = pd.read_csv("Data/cars_2024.csv")

In [26]:
df_cars.shape

(487851, 7)

In [8]:
df_cars.head()

     date_reg     type  maker    model  colour         fuel        state
0  2024-01-01      jip  Chery  Omoda 5   black       petrol  Rakan Niaga
1  2024-01-01      jip  Chery  Omoda 5   white       petrol  Rakan Niaga
2  2024-01-01      jip  Chery  Omoda 5   white       petrol  Rakan Niaga
3  2024-01-01  pick_up   Ford   Ranger   black       petrol        Johor
4  2024-01-01  pick_up   Ford   Ranger  orange  greendiesel        Johor

In [38]:
pd.DataFrame(df_cars['type'].unique())

                          0
0                       jip
1                   pick_up
2                   motokar
3                window_van
4  motokar_pelbagai_utiliti

In [41]:
# view as a table
pd.DataFrame(df_cars['maker'].unique())

# view as a list
df_cars['maker'].unique()

# to do distinct for all columns, but not prefer do this way
for header_column in df_cars.columns:
    print(df_cars[header_column].unique())

array(['Chery', 'Ford', 'Honda', 'Hyundai', 'Isuzu', 'Lamborghini',
       'Lexus', 'Mazda', 'Mercedes Benz', 'Mini', 'Mitsubishi', 'Perodua',
       'Porsche', 'Proton', 'Subaru', 'Toyota', 'Aston Martin', 'BMW',
       'BYD', 'Cam', 'Chrysler', 'Kia', 'Land Rover', 'Nissan', 'Peugeot',
       'Smart', 'Tesla', 'Volvo', 'Weststar Maxus', 'Bentley', 'Daimler',
       'Ferrari', 'Go Auto', 'Lotus', 'Neta', 'Suzuki', 'Foton',
       'Great Wall', 'Jeep', 'Volkswagen', 'Audi', 'Bison', 'Mclaren',
       'Rolls Royce', 'Ssangyong', 'Boon Koon', 'Maserati', 'Chevrolet',
       'Renault', 'Daihatsu', 'King Long Xiamen', 'Jaguar', 'JMS',
       'Alfa Romeo', 'Gac Motor', 'Fiat', 'MG', 'Higer',
       'Bufori Malaysia', 'Inokom', 'Shineray', 'Foday',
       'Mercedes-Maybach', 'Mitsuoka', 'Roewe', 'Vinfast',
       'Golden Dragon', 'Dodge', 'Pontiac', 'BAIC', 'Xiamen', 'BAW',
       'Lincoln', 'Chana', 'Zeekr', 'Cadillac', 'Jetour', 'Lancia',
       'Xpeng', 'Dong Feng'], dtype=object)

In [42]:
# to identify row & column
df_cars.shape

In [27]:
# get all column name
df_cars.columns

Index(['date_reg', 'type', 'maker', 'model', 'colour', 'fuel', 'state'], dtype='object')

In [46]:
# get specific column value
df_cars[['fuel']]

                 fuel
0              petrol
1              petrol
2              petrol
3              petrol
4         greendiesel
...               ...
487846       electric
487847  hybrid_petrol
487848  hybrid_petrol
487849  hybrid_petrol
487850  hybrid_petrol

[487851 rows x 1 columns]

In [49]:
# To get data with specific row and columns
df_cars.loc[1:90,['maker','model']]

In [50]:
# In order to change column name, you have to change header column into list first. 
list(df_cars.columns)

['date_reg', 'type', 'maker', 'model', 'colour', 'fuel', 'state']

In [54]:
New_column_name = ['RegistrationDate', 'CarType', 'CarMaker', 'CarModel', 'CarColour', 'CarFuel', 'State']

In [55]:
df_cars.columns = New_column_name

In [56]:
df_cars.head()

,RegistrationDate,CarType,CarMaker,CarModel,CarColour,CarFuel,State
0,2024-01-01,jip,Chery,Omoda 5,black,petrol,Rakan Niaga
1,2024-01-01,jip,Chery,Omoda 5,white,petrol,Rakan Niaga
2,2024-01-01,jip,Chery,Omoda 5,white,petrol,Rakan Niaga
3,2024-01-01,pick_up,Ford,Ranger,black,petrol,Johor
4,2024-01-01,pick_up,Ford,Ranger,orange,greendiesel,Johor

In [57]:
df_cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 487851 entries, 0 to 487850
Data columns (total 7 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   RegistrationDate  487851 non-null  object
 1   CarType           487851 non-null  object
 2   CarMaker          487851 non-null  object
 3   CarModel          487851 non-null  object
 4   CarColour         487851 non-null  object
 5   CarFuel           487851 non-null  object
 6   State             487851 non-null  object
dtypes: object(7)
memory usage: 26.1+ MB

In [ ]:
# To change dataType string into Date for 'RegistrationDate'
df_cars['RegistrationDate'] = pd.to_datetime()